{
  "stories": [
    {
      "date": "2025-11-06",
      "category": "Startups",
      "headline": "Cape Town Agritech Startup eFama Wins Meta’s Llama Impact Accelerator 2025",
      "preview": "eFama’s AI-powered platform just bagged Meta’s top prize for innovation, and it’s about to change how farmers and buyers connect in Africa.",
      "fullStory": "Cape Town-based agritech startup eFama has clinched first place in Meta’s Llama Impact Accelerator 2025 — a program spotlighting the most promising AI ventures in Africa...",
      "image": "https://tmistudios.xyz/images/efama.jpeg"
    },
    {
      "date": "2025-11-06",
      "category": "Tech",
      "headline": "African Super-App Gozem officially lands in Brazzaville 🎉",
      "preview": "Gozem expands into Central Africa, offering ride-hailing, delivery, and financial services via one app in Brazzaville.",
      "fullStory": "The Francophone Africa “super-app” Gozem has officially launched its operations in Brazzaville (Republic of the Congo) as of 6 November 2025, marking a major step in its regional expansion. The move furthers Gozem’s mission to bundle ride-hailing, delivery, and financial services under one roof – all tailored for African users.<br><br>For Brazzaville residents, this means you can now book standard taxis, ride in air-conditioned comfort options, or hire by the hour for errands or business trips — all via the Gozem app. Drivers (dubbed “Champions”) are also being onboarded, giving local earners new opportunities via this digital platform. Gozem says it already has more than 2 million users and over 30 million trips completed in its footprint.<br><br>What makes this rollout noteworthy:<br>- It shows African-founded tech scaling regionally — beyond West Africa into Central Africa.<br>- It strengthens the “super-app” play in Africa: one app, multiple services.<br>- It gives Brazzaville a shot at improved mobility options just as digital infrastructure is expanding across the country.<br><br>But it’s not all plug-and-play. Gozem’s challenge will be localizing: adjusting to Brazzaville’s transport regulations, language/market specifics, driver onboarding, payments infrastructure, and competition. If it nails those, it could become a serious player in Central African mobility and digital services.",
      "image": "https://tmistudios.xyz/images/gozem.jpeg"
    },
    {
      "date": "2025-11-01",
      "category": "Business",
      "headline": "Pepkor Drops $98M Bag, Snaps Up Retailability — and the Streets Are Buzzing",
      "preview": "The retail giant just made a power move that could shake up how South Africans shop (and spend) in 2026.",
      "fullStory": "South Africa’s retail scene just got a reality check. Pepkor — the everyday-value powerhouse behind PEP and Ackermans — officially sealed the deal on a $98 million acquisition of Retailability...",
      "image": "https://tmistudios.xyz/images/pepkor.jpeg"
    },
    {
      "date": "2025-10-30",
      "category": "Business",
      "headline": "Alibaba Opens Doors in Durban",
      "preview": "South Africa welcomes Alibaba’s first local office, signaling big moves in e-commerce.",
      "fullStory": "Durban just leveled up. The e-commerce and cloud behemoth Alibaba is bringing its global reach to South Africa...",
      "image": "https://tmistudios.xyz/images/alibaba.jpeg"
    },
    {
      "date": "2025-10-28",
      "category": "Events",
      "headline": "LED Summit 2025 Highlights",
      "preview": "Local economic development leaders gather to strategize innovation in Durban.",
      "fullStory": "The LED Summit held in Durban over the past few days brought together government officials, entrepreneurs, and investors...",
      "image": "https://tmistudios.xyz/images/ledsummit.jpeg"
    },
    {
      "date": "2025-10-23",
      "category": "Investment",
      "headline": "KZN Investment Conference 2025",
      "preview": "TMI gets the front-row view of Durban’s biggest investment meet.",
      "fullStory": "From panel discussions on local startups to impromptu networking chaos, TMI reported live from the Durban ICC...",
      "image": "https://tmistudios.xyz/images/investment.jpeg"
    }
  ]
}
