{
  "stories": [
    {
  "date": "2025-11-07",
  "category": "Tech & Justice",
  "headline": "After 17 Years, 'Please Call Me' Inventor Finally Wins Against Vodacom",
  "preview": "Makate’s David vs. Goliath moment finally pays off — 17 years later, justice picks up the call.",
  "fullStory": "After nearly two decades of legal warfare, South African innovator Nkosana Makate has officially triumphed in his historic battle against Vodacom — the telecom giant behind the world-famous ‘Please Call Me’ service...",
  "image": "https://tmistudios.xyz/news/images/makate.jpeg"
    },
    {
      "date": "2025-11-07",
      "category": "Business",
      "headline": "South African Banking Giant Nedbank Group to Acquire Fintech iKhokha in ~R1.65 B Deal",
      "preview": "Cape Town fintech iKhokha is being acquired by Nedbank for R1.65 billion, marking a major push into the SME digital payments space.",
      "fullStory": "Cape Town-based fintech iKhokha is poised for a major exit in South Africa’s SME payments space as Nedbank Group announced a binding agreement to acquire 100% of iKhokha for approximately R1.65 billion...",
      "image": "https://tmistudios.xyz/images/ikhokha.jpeg"
    },
    {
      "date": "2025-11-06",
      "category": "Startups",
      "headline": "Cape Town Agritech Startup eFama Wins Meta’s Llama Impact Accelerator 2025",
      "preview": "eFama’s AI-powered platform just bagged Meta’s top prize for innovation, and it’s about to change how farmers and buyers connect in Africa.",
      "fullStory": "Cape Town-based agritech startup eFama has clinched first place in Meta’s Llama Impact Accelerator 2025 — a program spotlighting the most promising AI ventures in Africa...",
      "image": "https://tmistudios.xyz/images/efama.jpeg"
    },
    {
      "date": "2025-11-06",
      "category": "Tech",
      "headline": "African Super-App Gozem officially lands in Brazzaville 🎉",
      "preview": "Gozem expands into Central Africa, offering ride-hailing, delivery, and financial services via one app in Brazzaville.",
      "fullStory": "The Francophone Africa “super-app” Gozem has officially launched its operations in Brazzaville (Republic of the Congo) as of 6 November 2025...",
      "image": "https://tmistudios.xyz/images/gozem.jpeg"
    },
    {
      "date": "2025-11-01",
      "category": "Business",
      "headline": "Pepkor Drops $98M Bag, Snaps Up Retailability — and the Streets Are Buzzing",
      "preview": "The retail giant just made a power move that could shake up how South Africans shop (and spend) in 2026.",
      "fullStory": "South Africa’s retail scene just got a reality check. Pepkor — the everyday-value powerhouse behind PEP and Ackermans — officially sealed the deal on a $98 million acquisition of Retailability...",
      "image": "https://tmistudios.xyz/images/pepkor.jpeg"
    },
    {
      "date": "2025-10-30",
      "category": "Business",
      "headline": "Alibaba Opens Doors in Durban",
      "preview": "South Africa welcomes Alibaba’s first local office, signaling big moves in e-commerce.",
      "fullStory": "Durban just leveled up. The e-commerce and cloud behemoth Alibaba is bringing its global reach to South Africa...",
      "image": "https://tmistudios.xyz/images/alibaba.jpeg"
    },
    {
      "date": "2025-10-28",
      "category": "Events",
      "headline": "LED Summit 2025 Highlights",
      "preview": "Local economic development leaders gather to strategize innovation in Durban.",
      "fullStory": "The LED Summit held in Durban over the past few days brought together government officials, entrepreneurs, and investors...",
      "image": "https://tmistudios.xyz/images/ledsummit.jpeg"
    },
    {
      "date": "2025-10-23",
      "category": "Investment",
      "headline": "KZN Investment Conference 2025",
      "preview": "TMI gets the front-row view of Durban’s biggest investment meet.",
      "fullStory": "From panel discussions on local startups to impromptu networking chaos, TMI reported live from the Durban ICC...",
      "image": "https://tmistudios.xyz/images/investment.jpeg"
    }
  ],
  "tech": [],
  "poi": []
}
